.. _asmens_userguide:

Lithuanian Personal Numbers
===========================

Introduction
------------

The function :func:`clean_lt_asmens() <dataprep.clean.clean_lt_asmens.clean_lt_asmens>` cleans a column containing Lithuanian personal number (Asmens koda) strings, and standardizes them in a given format. The function :func:`validate_lt_asmens() <dataprep.clean.clean_lt_asmens.validate_lt_asmens>` validates either a single Asmens koda strings, a column of Asmens koda strings or a DataFrame of Asmens koda strings, returning `True` if the value is valid, and `False` otherwise.

Asmens koda strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "33309240064"
* `standard`: Asmens koda strings with proper whitespace in the proper places. Note that in the case of Asmens koda, the compact format is the same as the standard one.
* `birthdate`: split the date parts from the number and return the birth date, like "1933-09-24".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_lt_asmens()` and `validate_lt_asmens()`.

### An example dataset containing Asmens koda strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "asmens": [
            '33309240064',
            '33309240164',
            '7542011030',
            '7552A10004',
            '8019010008',
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

        asmens                                           address
0  33309240064                                     123 Pine Ave.
1  33309240164                                           main st
2   7542011030                      1234 west main heights 57033
3   7552A10004                    apt 1 789 s maple rd manhattan
4   8019010008                robie house, 789 north main street
5        hello         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NULL                                             hello

## 1. Default `clean_lt_asmens`

By default, `clean_lt_asmens` will clean asmens strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_lt_asmens
clean_lt_asmens(df, column = "asmens")

        asmens                                           address asmens_clean
0  33309240064                                     123 Pine Ave.  33309240064
1  33309240164                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_lt_asmens(df, column = "asmens", output_format="standard")

        asmens                                           address asmens_clean
0  33309240064                                     123 Pine Ave.  33309240064
1  33309240164                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `compact`

In [4]:
clean_lt_asmens(df, column = "asmens", output_format="compact")

        asmens                                           address asmens_clean
0  33309240064                                     123 Pine Ave.  33309240064
1  33309240164                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `birthdate`

In [5]:
clean_lt_asmens(df, column = "asmens", output_format="birthdate")

        asmens                                           address asmens_clean
0  33309240064                                     123 Pine Ave.   1933-09-24
1  33309240164                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned Asmens koda strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_lt_asmens(df, column="asmens", inplace=True)

  asmens_clean                                           address
0  33309240064                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_lt_asmens(df, "asmens", errors="coerce")

        asmens                                           address asmens_clean
0  33309240064                                     123 Pine Ave.  33309240064
1  33309240164                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `ignore`

In [8]:
clean_lt_asmens(df, "asmens", errors="ignore")

        asmens                                           address asmens_clean
0  33309240064                                     123 Pine Ave.  33309240064
1  33309240164                                           main st  33309240164
2   7542011030                      1234 west main heights 57033   7542011030
3   7552A10004                    apt 1 789 s maple rd manhattan   7552A10004
4   8019010008                robie house, 789 north main street   8019010008
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        hello
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 4. `validate_lt_asmens()`

`validate_lt_asmens()` returns `True` when the input is a valid Asmens koda. Otherwise it returns `False`.

The input of `validate_lt_asmens()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_lt_asmens()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_lt_asmens()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_lt_asmens
print(validate_lt_asmens('33309240064'))
print(validate_lt_asmens('33309240164'))
print(validate_lt_asmens('7542011030'))
print(validate_lt_asmens('7552A10004'))
print(validate_lt_asmens('8019010008'))
print(validate_lt_asmens("hello"))
print(validate_lt_asmens(np.nan))
print(validate_lt_asmens("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_lt_asmens(df["asmens"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: asmens, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_lt_asmens(df, column="asmens")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: asmens, dtype: bool

### Only DataFrame

In [12]:
validate_lt_asmens(df)

   asmens  address
0    True    False
1   False    False
2   False    False
3   False    False
4   False    False
5   False    False
6   False    False
7   False    False